//#define  _CRT_SECURE_NO_WARNINGS  1
//#pragma warning(disable:6031)
//
///*
//已有一排好序的数组a（键盘输入），现输入一个数，要求按原来排序的规律将它插入数组中
//*/
//
////我要是不知道多长呢？？
//
//#include <stdio.h>
//
//int main()
//{
//	int arr[20] = { 0 };
//	int i = 0;
//	int n = 0;
//	int insert = 0;
//	int  tem1 = 0;            //temporary; 临时的意思
//	int  tem2 = 0;
//	printf("你想让这个已经排序好的数组里面有几个元素:\n");
//		scanf("%d", &n);
//			printf("开始输入:\n");
//	for (i = 0; i <n ; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//
//	printf("输入想插入的数:/n");
//	scanf("%d", &insert);
//
//	//从前往后想
//	//麻烦方法   正常简单点的再后面
//	for (i = 1; i < n+1; i++)
//	{
//		// 虽然是麻烦方法 但这样写，就能少往后延申用不到的数组   让i从1开始  arr[i-1]
//
//		if (insert > arr[i-1] && insert < arr[i])  //这样写更好 不然需要 只因为打印>arr[i]就插入后面往后挤的话 可能要因此多执行好几次
//		{
//			                                                            //但即使这样写 正向想 也要创建俩变量 用来储存数组中的元素
//
//			tem1 = arr[i ];
//			tem2 = arr[i + 1];
//			
//
//		}
//	}
//
//	// n+1
//
//	for (i = 0; i < n + 1; i++)
//	{
//		printf("%d", arr[i]);
//	}
//
//
//
//	//从后往前想更简单 逆向思维
//	//这题和 数据结构初阶中的扭转数组最麻烦那个处理方法很像
//	
//}