////#define  _CRT_SECURE_NO_WARNINGS  1
////#pragma warning(disable:6031)
/////*程序分别用选择法和冒泡法对数组a[M]按从大到小的顺序进行排序*/
////
////
////   没看到表格  后面看表格怎么解决
//////选择法
////
//////每次挑选数组中最大打印出来
////
////#include<stdio.h>
////
////#define M 4
////int main()
////{
////	double arr[M] = { 0 };
////	int i = 0;
////	int max = 0;
////	int min = 0;
////	int i1 = 0;
////	int i2 = 0;
////	int n = 0;
////
////	for (i = 0; i < M; i++)
////	{
////		scanf(" %lf", &arr[i]);
////	}
////
////
////	//让每次进来的值都比原来大一
////
////	//好复杂
////	for (i1 = 0; i1 < M; i1++)
////	{
////		max = arr[i1];
////		i2 = i1;
////		for (i2; i2 < M; i2++)
////		{
////			if (max < arr[i2])
////			{
////				max = arr[i2];
////			}
////		}
////		n = arr[i1];
////		arr[i1] = max;
////
////		for (i = i1 + 1; i < M; i++)
////		{
////			if (max == arr[i])
////			{
////				arr[i] = n;
////			}
////		}
////		printf("%.1lf ", arr[i1]);
////	}
////}
////
////
//
//
//
//////冒泡排序
////// 
//////怎么加一个提前终止的条件？
////#include<stdio.h>
////
////# define M 4
////
////int main()
////{
////	int arr[M] = { 0 };
////	int i = 0;
////	int  n = 0;
////	int i1 = 0;
////
////	for (i = 0; i < M; i++)
////	{
////		scanf("%d", &arr[i]);
////	}
////	
////	//排的次数
////	for (i1 = 1; i1 < M; i1++)    //M个元素  M-1趟
////	{
////		//实现一次排序
////		for (i = 0; i < M-1; i++)  //一次排M-1次
////		{
////			if (arr[i] < arr[i + 1])
////			{
////				n = arr[i];
////				arr[i] = arr[i + 1];
////				arr[i + 1] = n;
////			}
////		}
////
////	}
////
////	for (i = 0; i < M; i++)
////	{
////		printf("%d ", arr[i]);
////	}
////}