//#define  _CRT_SECURE_NO_WARNINGS  1
//#pragma warning(disable:6031)
//
/////*
//#include<stdio.h>
//int main()
//{
//int i,j;
//long sum=0;
//for(i=1;i<=20;i++)
//	for(j=1;j<=3;j++)
//		sum=sum+(i+1)*(i+1)*(j+2);
//printf("sum is:%d\n",sum);
//}
//1 将上述程序中的和分别做什么样修改，能使程序按如下要求运行：
//①不循环；                                           i <  1
//②外循环1次，不进入内循环；          i <= 1   and   j < 1 
//③外循环，内循环各1次；                  i <= 1  and  j <= 1
//④外循环1次，内循环2次；                i = 1     and  j <= 2
//⑤外循环2次，内循环1次；                i <=2   and  j<= 1
//⑥外循环19次，内循环3次；              i <20    
//⑦外循环20次，内循环2次。                                  j<3
//
//
//（3）内循环与外循环的控制表达式进行对换，观察程序的执行结果有无变化，并且观察对换后的外循环与内循环控制表达式执行的总次数有无变化？
//
//答：结果没发生变化   并且实际起运算作用的就是内循环，内循环次数没变   而每次变量都是规律的，不影响里面的计算次数和汇率最后运算结果相同
//
//这个地方有点像那个 投机取巧打印二维数组 先后计算不一样 但总共结果就那些 最后加起来是一样的 就跟二维数组 先打印行后打印列 和  先打印列后打印行一样。
//
//*/
//
//
////（2）
//#include<stdio.h>
//int main()
//{
//	int i, j;
//	long sum = 0;
//	int num1 = 0;   //运行一次加1
//	int num2 = 0;   //运行一次加1
//	for (i = 1; i <= 20; i++)
//	{
//		num1++;
//		for (j = 1; j <= 3; j++)
//		{
//			num2++;
//			sum = sum + (i + 1) * (i + 1) * (j + 2);
//		}
//	}
//	printf("外循环：%d次，内循环：%d次\n", num1, num2);
//	printf("sum is:%d\n", sum);
//}


//（4）
//无变化
//
//#include<stdio.h>
//main()
//{
//	int i, j, k;
//	long sum = 0;
//	int num1 = 0;
//	int num2 = 0;
//	for (j = 1;j <= 3;j++)
//	{
//		num1++;
//		
//		for (i = 1; i <= 20; i++)
//		{
//			num2++;
//			sum = sum + (i + 1) * (i + 1) * ( j + 2);
//		}
//	}
//printf("外循环：%d次，内循环：%d次\n", num1, num2);
//	printf("sum is %d", sum);
//
//}
