#define  _CRT_SECURE_NO_WARNINGS  1
#pragma warning(disable:6031)
/*输入自然数n，将n分解为质因子连乘的形式输出，例如，输入756，则程序运行后，输出结果显示为756=2*2*3*3*3*7。*/


//#include <math.h>
//#include <stdio.h>
//	void  main()
//	{
//		//先判断是不是质数
//	    //从小到大除
//		int m, n, i, j, k, sum;
//		sum = 0;
//		scanf("%d", &n);
//
//		if (n == 1)
//		{
//			printf("无法分解");
//		}
//
//		else
//		{
//			//记得从2开始 
//
//			printf("%d=",n);
//			for (i = 2; i <= n; i++)
//			{
//				//if (n == 0)
//				//{
//				//	break;
//				//}
//				k = sqrt(i);
//				for (j = 2; j <= k; j++)
//					if (i % j == 0 )
//					{
//						break;
//					}
//				//这里面保证是质数
//				if (j > k)
//				{
////这个写法漏洞很大 会在5的时候也停止 判断条件没找好 能拆分 就说明能被他整除
//					//for (i;1 ; )
//
//					//{
//					//	n /= i;
//					//		if ((n%i) !=0)
//					//		{
//					//			break;
//					//		}
//					//		printf("%d*", i);
//					//}
//
//					while (n % i == 0)
//					{
//						printf("%d*", i);
//						n=n / i;
//							//只写上面一段 虽然已经足够，但是结果出来后，循环还在进行，为了缩短时间  可以加一段 上面注释里的break；
//
//					}
//
//
//				}
//			}
//			//退格键 细节每一天
//			printf("\b");
//		}
//}
